app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 1], ["comment", "test movie"], ["user_id", 1], ["movie_id", 2], ["created_at", "2016-08-02 08:00:25.122528"], ["updated_at", "2016-08-02 08:00:25.122528"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    respond_to do |format|
      if @review.save